-- REPORT_REASON 더미 데이터
INSERT INTO REPORT_REASON (reason)
VALUES ('욕설 및 비방'),
       ('스팸 및 광고'),
       ('음란물 게시'),
       ('허위 정보 유포'),
       ('개인정보 유출'),
       ('도배 및 중복 게시'),
       ('사기 및 사칭'),
       ('저작권 침해'),
       ('불법 행위 유도'),
       ('기타');

-- REPORT 더미 데이터
INSERT INTO REPORT (date, status, category, reported_id, report_reason_id, member_id)
VALUES ('2025-03-01', '처리중', '게시글', 1, 1, 10),
       ('2025-03-02', '보류', '댓글', 1, 2, 11),
       ('2025-03-03', '승인', '회원', 1, 3, 12),
       ('2025-03-04', '처리중', '게시글', 2, 4, 13),
       ('2025-03-05', '보류', '댓글', 2, 5, 14),
       ('2025-03-06', '승인', '회원', 2, 6, 10),
       ('2025-03-07', '처리중', '게시글', 3, 7, 12),
       ('2025-03-08', '보류', '댓글', 3, 8, 11),
       ('2025-03-09', '승인', '회원', 3, 9, 12),
       ('2025-03-10', '처리중', '게시글', 4, 10, 13),
       ('2025-03-11', '보류', '댓글', 4, 1, 16),
       ('2025-03-12', '승인', '회원', 4, 2, 14),
       ('2025-03-13', '처리중', '게시글', 5, 3, 9),
       ('2025-03-14', '보류', '댓글', 5, 4, 15),
       ('2025-03-15', '승인', '회원', 5, 5, 20),
       ('2025-03-16', '처리중', '게시글', 6, 6, 21),
       ('2025-03-17', '보류', '댓글', 6, 7, 11),
       ('2025-03-18', '승인', '회원', 6, 8, 18),
       ('2025-03-19', '처리중', '게시글', 7, 9, 10),
       ('2025-03-20', '보류', '댓글', 7, 10, 8);

-- REGULATION 더미 데이터
INSERT INTO REGULATION (start_date, end_date, member_id)
VALUES
-- 회원 1이 신고 3번 당해 정지 3일
('2025-03-09', '2025-03-12', 1),
-- 회원 2가 신고 3번 당해 정지 3일
('2025-03-10', '2025-03-13', 2),
-- 회원 1이 신고 5번 당해 정지 5일
('2025-03-15', '2025-03-20', 1),
-- 회원 2가 신고 5번 당해 정지 5일
('2025-03-16', '2025-03-21', 2);