-- CHALLENGE 테이블 더미 데이터
INSERT INTO CHALLENGE (name)
VALUES
('로그인'),
('게시글'),
('댓글'),
('Q&A 채택'),
('커밋'),
('이슈 생성'),
('PR 리뷰'),
('PR 생성'),
('팀 커밋'),
('프로젝트 완료'),
('회의록'),   # 여기까지 과제 및 미션 카테고리
('현업'),
('자격증'),
('학력'),
('Git');

-- ACHIEVEMENT 테이블 더미 데이터
INSERT INTO ACHIEVEMENT (requirement, exp, is_deleted, challenge_id)
VALUES
(10, 100, 'N', 1),
(5, 50, 'N', 2),
(15, 40, 'N', 3),
(10, 40, 'N', 4),
(10, 50, 'N', 5),
(10, 60, 'N', 6),
(10, 50, 'N', 7),
(5, 80, 'N', 8),
(0, 100, 'N', 9),
(1, 150, 'N', 10),
(3, 70, 'N', 11);

-- DAILY_MISSION 테이블 더미 데이터
INSERT INTO DAILY_MISSION (content, exp_point, is_deleted, challenge_id)
VALUES
('로그인 하기', 10, 'N', 1),
('게시글 작성하기', 20, 'N', 2),
('댓글 작성하기', 15, 'N', 3),
('Q&A 채택받기', 30, 'N', 4),
('일일 커밋하기', 20, 'N', 5),
('이슈 생성하기', 20, 'N', 6),
('PR 리뷰하기', 25, 'N', 7),
('PR 생성하기', 70, 'N', 8),
('회의록 작성하기', 90, 'N', 11);

-- BADGE 테이블 더미 데이터
INSERT INTO BADGE (requirement, advantage, description, is_deleted, challenge_id)
VALUES
(30, 0, '누적 출석', 'N', 1),
(20, 0, '게시글 작성하기', 'N', 2),
(30, 0, '댓글 작성하기', 'N', 3),
(30, 0, 'Q&A 채택되기', 'N', 4),
(20, 0, '커밋하기', 'N', 5),
(20, 0, '이슈 생성하기', 'N', 6),
(20, 0, 'PR 리뷰하기', 'N', 7),
(10, 0, 'PR 생성하기', 'N', 8),
(1, 0, '팀 전체 커밋', 'N', 9),
(3, 0, '프로젝트 완료', 'N', 10),
(9, 0, '회의록 작성', 'N', 11),
(3, 5, '경력 3년', 'N',12),  #여기부터 실력 뱃지
(0,3,'정보처리기사', 'N', 13),
(0,3,'SQLD', 'N', 13),
(0,3,'SQLP', 'N', 13),
(0,3,'정보보안기사', 'N', 13),
(0,3,'리눅스마스터', 'N', 13),
(0,3,'네트워크관리사', 'N', 13),
(0,3,'OCJP', 'N', 13),
(0,3,'ERP 정보관리사', 'N', 13),
(0,3,'빅데이터 분석기사', 'N', 13),
(0,3,'AWS', 'N', 13),
(0,3,'Java 프로그래밍 전문가', 'N', 13),
(0,3,'전문학사', 'N', 14),
(0,3,'학사', 'N', 14),
(0,3,'석사', 'N', 14),
(0,3,'박사', 'N', 14),
(50, 50, 'Git 잔디 개수', 'N', 15);

-- MEMBER_ACHIEVEMENT 테이블 더미 데이터
INSERT INTO MEMBER_ACHIEVEMENT (achieved_date, progress, achieved_time, achievement_id, member_id)
VALUES
('2025-03-01', 30, 3, 1, 1),
('2025-03-02', 20, 4, 2, 2),
('2025-03-03', 30, 2, 3, 3),
('2025-03-04', 20, 2, 4, 4),
('2025-03-05', 20, 2, 5, 5),
('2025-03-06', 20, 2, 6, 1),
('2025-03-07', 20, 2, 7, 2),
('2025-03-08', 10, 2, 8, 3),
('2025-03-09', 1, 1, 9, 4),
('2025-03-10', 3, 3, 10, 5),
('2025-03-10', 9, 3, 11, 5);

-- MEMBER_DAILY_MISSION 테이블 더미 데이터
INSERT INTO MEMBER_DAILY_MISSION (is_completed, accepted_date, daily_mission_id, member_id)
VALUES
('Y', '2025-03-01', 1, 1),
('Y', '2025-03-02', 2, 2),
('Y', '2025-03-03', 3, 3),
('Y', '2025-03-04', 4, 4),
('Y', '2025-03-05', 5, 5),
('N', '2025-03-06', 6, 1),
('N', '2025-03-07', 7, 2),
('Y', '2025-03-08', 8, 3),
('N', '2025-03-09', 9, 4),
('Y', '2025-03-10', 9, 5);

-- MEMBER_BADGE 테이블 더미 데이터
INSERT INTO MEMBER_BADGE (acquired_date, level, badge_id, member_id)
VALUES
('2025-03-01', 1, 1, 1),
('2025-03-02', 1, 2, 2),
('2025-03-03', 1, 3, 3),
('2025-03-04', 1, 4, 4),
('2025-03-05', 1, 5, 5),
('2025-03-06', 1, 6, 1),
('2025-03-07', 1, 7, 2),
('2025-03-08', 1, 8, 3),
('2025-03-09', 1, 9, 4),
('2025-03-10', 1, 10, 5),
('2025-03-10', 1, 11, 5),
('2024-12-15', 1, 12, 1),
('2024-12-15', 1, 13, 2),
('2024-12-15', 1, 15, 3),
('2024-12-15', 1, 14, 4),
('2024-12-15', 1, 14, 5);