-- 게시글 테이블 더미 데이터

INSERT
INTO POST
    (title, content, category, upload_at, status, member_id)
VALUES ('1번 게시글 제목', '1번 게시글 내용', 1, '2025-03-17 01:11:11', 'YES', 1)
     , ('2번 게시글 제목', '2번 게시글 내용', 1, '2025-03-17 01:11:12', 'YES', 2)
     , ('3번 게시글 제목', '3번 게시글 내용', 1, '2025-03-17 01:11:13', 'YES', 3)
     , ('4번 게시글 제목', '4번 게시글 내용', 2, '2025-03-17 01:11:14', 'YES', 4)
     , ('5번 게시글 제목', '5번 게시글 내용', 2, '2025-03-17 01:11:15', 'YES', 5)
     , ('6번 게시글 제목', '6번 게시글 내용', 1, '2025-03-17 01:11:16', 'YES', 6)
     , ('7번 게시글 제목', '7번 게시글 내용', 1, '2025-03-17 01:11:17', 'YES', 7)
     , ('8번 게시글 제목', '8번 게시글 내용', 1, '2025-03-17 01:11:18', 'YES', 8)